CUsersHYPERPCDocuments1CDemoConversion1/src/DataProcessors/ОбособлениеКонвертации/ОбособлениеКонвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбособлениеКонвертации</name>
  <attributes>
    <name>Конвертация</name>
    <type>
      <types>CatalogRef.Конвертации</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/СоставыКонвертаций/СоставыКонвертаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоставыКонвертаций</name>
  <owners>Catalog.Конвертации</owners>
  <attributes>
    <name>ЭлементКонвертации</name>
    <type>
      <types>CatalogRef.ПравилаКонвертацииПредопределенныхДанных</types>
      <types>CatalogRef.ПравилаКонвертацииОбъектов</types>
      <types>CatalogRef.Алгоритмы</types>
      <types>CatalogRef.ПравилаОбработкиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/ПравилаОбработкиДанных/ПравилаОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаОбработкиДанных</name>
  <basedOn>Catalog.ПравилаКонвертацииОбъектов</basedOn>
  <attributes>
    <name>АлгоритмВыборкаДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередОбработкой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриОбработке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ГруппыПравил</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектВыборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоКонвертацииОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчисткаДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПравилаКонвертацииОбъектов</name>
    <attributes>
      <name>ПравилоКонвертацииОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CUsersHYPERPCDocuments1CDemoConversion1/src/DataProcessors/ОбособлениеКонвертации/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВариантРаботы = "Единичный";
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантРаботыПриИзменении(Элемент)
	Если ВариантРаботы = "Единичный" И СписокКонвертаций.Количество() > 0 Тогда
		Объект.Конвертация = СписокКонвертаций[0].Значение;
	ИначеЕсли ВариантРаботы = "Множественный" И СписокКонвертаций.Количество() = 0
		И ЗначениеЗаполнено(Объект.Конвертация) Тогда
		СписокКонвертаций.Добавить(Объект.Конвертация);
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбособитьКонвертацию(Команда)
	Если ВариантРаботы = "Единичный" И НЕ ЗначениеЗаполнено(Объект.Конвертация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указана конвертация'"));
		Возврат;
	ИначеЕсли ВариантРаботы = "Множественный" И СписокКонвертаций.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указана ни одна конвертация'"));
		Возврат;
	КонецЕсли;
	МассивСвязанныхКонвертаций = СвязанныеКонвертации(ВариантРаботы, Объект.Конвертация, СписокКонвертаций.ВыгрузитьЗначения());
	Если МассивСвязанныхКонвертаций.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Данная конвертация уже обособлена.'"));
		Возврат;
	КонецЕсли;
	Если ВариантРаботы = "Единичный" Тогда
		ТекстВопроса = НСтр("ru = 'Данная конвертация будет обособлена от следующих конвертаций'") + Символы.ПС;
	Иначе
		ТекстВопроса = НСтр("ru = 'Указанные конвертации будут обособлены от следующих конвертаций'") + Символы.ПС;
	КонецЕсли;
	Для Каждого СвязаннаяКонвертация Из МассивСвязанныхКонвертаций Цикл
		ТекстВопроса = ТекстВопроса + СокрЛП(СвязаннаяКонвертация) + ", ";
	КонецЦикла;
	ТекстВопроса = Лев(ТекстВопроса, СтрДлина(ТекстВопроса)-2) + Символы.ПС + НСтр("ru = 'Продолжить?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыбранВариантДействий", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
// Обработчик ожидания после ответа на вопрос пользователя.
Процедура ВыбранВариантДействий(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ОбособитьКонвертациюНаСервере(ВариантРаботы,Объект.Конвертация, СписокКонвертаций.ВыгрузитьЗначения());
	Если ВариантРаботы = "Единичный" Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Конвертация обособлена.'"));
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Конвертации обособлены.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если ВариантРаботы = "Единичный" Тогда
		ТекСтраница = Элементы.ОднаКонвертация;
		ЗаголовокКнопки = НСтр("ru = 'Обособить конвертацию'");
	Иначе
		ТекСтраница = Элементы.НесколькоКонвертаций;
		ЗаголовокКнопки = НСтр("ru = 'Обособить конвертации'");
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ТекСтраница;
	Элементы.ФормаОбособитьКонвертацию.Заголовок = ЗаголовокКнопки;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвязанныеКонвертации(ВариантРаботы, Конвертация, МассивКонвертаций)
	Запрос = Новый Запрос;
	Если ВариантРаботы = "Единичный" Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоставЧужая.Владелец КАК КонвертацияСвязанная
		|ИЗ Справочник.СоставыКонвертаций КАК СоставНаша
		|СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставЧужая
		|ПО СоставНаша.Владелец <> СоставЧужая.Владелец
		|	И СоставНаша.ЭлементКонвертации = СоставЧужая.ЭлементКонвертации
		|	И НЕ СоставЧужая.Отключить И НЕ СоставЧужая.ПометкаУдаления
		|ГДЕ СоставНаша.Владелец = &ТекКонвертация И НЕ СоставНаша.Отключить
		|	И НЕ СоставНаша.ПометкаУдаления
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.Алгоритмы.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииОбъектов.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаОбработкиДанных.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииПредопределенныхДанных.ПустаяСсылка)";
		Запрос.УстановитьПараметр("ТекКонвертация", Конвертация);
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоставЧужая.Владелец КАК КонвертацияСвязанная
		|ИЗ Справочник.СоставыКонвертаций КАК СоставНаша
		|СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставЧужая
		|ПО СоставНаша.ЭлементКонвертации = СоставЧужая.ЭлементКонвертации
		|	И НЕ СоставЧужая.Отключить И НЕ СоставЧужая.ПометкаУдаления
		|ГДЕ СоставНаша.Владелец В (&МассивКонвертаций) И НЕ СоставНаша.Отключить
		|	И НЕ (СоставЧужая.Владелец В (&МассивКонвертаций))
		|	И НЕ СоставНаша.ПометкаУдаления
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.Алгоритмы.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииОбъектов.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаОбработкиДанных.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииПредопределенныхДанных.ПустаяСсылка)";

		Запрос.УстановитьПараметр("МассивКонвертаций", МассивКонвертаций);
	КонецЕсли;
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КонвертацияСвязанная");
КонецФункции
&НаСервереБезКонтекста
Процедура ОбособитьКонвертациюНаСервере(ВариантРаботы, Конвертация, МассивКонвертаций)
	Запрос = Новый Запрос;
	Если ВариантРаботы = "Единичный" Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоставНаша.ЭлементКонвертации КАК ЭлементКонвертации,
		|	СоставНаша.Ссылка КАК СоставСсылка
		|ИЗ Справочник.СоставыКонвертаций КАК СоставНаша
		|СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставЧужая
		|ПО СоставНаша.Владелец <> СоставЧужая.Владелец
		|	И СоставНаша.ЭлементКонвертации = СоставЧужая.ЭлементКонвертации
		|	И НЕ СоставЧужая.Отключить И НЕ СоставЧужая.ПометкаУдаления
		|ГДЕ СоставНаша.Владелец = &ТекКонвертация И НЕ СоставНаша.Отключить
		|	И НЕ СоставНаша.ПометкаУдаления
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.Алгоритмы.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииОбъектов.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаОбработкиДанных.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииПредопределенныхДанных.ПустаяСсылка)";
		Запрос.УстановитьПараметр("ТекКонвертация", Конвертация);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			// Создаем копию элемента до изменения.
			ЭлементКонвертацииОбъект = Выборка.ЭлементКонвертации.Скопировать();
			ЭлементКонвертацииОбъект.Записать();
			// Меняем состав конвертации.
			СоставКонвертацийОбъект = Выборка.СоставСсылка.ПолучитьОбъект();
			СоставКонвертацийОбъект.ЭлементКонвертации = ЭлементКонвертацииОбъект.Ссылка;
			СоставКонвертацийОбъект.Записать();
		КонецЦикла;

	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоставНаша.ЭлементКонвертации КАК ЭлементКонвертации,
		|	СоставНаша.Ссылка КАК СоставСсылка
		|ИЗ Справочник.СоставыКонвертаций КАК СоставНаша
		|СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставЧужая
		|ПО СоставНаша.Владелец <> СоставЧужая.Владелец
		|	И СоставНаша.ЭлементКонвертации = СоставЧужая.ЭлементКонвертации
		|	И НЕ СоставЧужая.Отключить И НЕ СоставЧужая.ПометкаУдаления
		|ГДЕ СоставНаша.Владелец В (&МассивКонвертаций) И НЕ СоставНаша.Отключить
		|	И НЕ СоставЧужая.Владелец В (&МассивКонвертаций)
		|	И НЕ СоставНаша.ПометкаУдаления
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.Алгоритмы.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииОбъектов.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаОбработкиДанных.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииПредопределенныхДанных.ПустаяСсылка)
		|ИТОГИ ПО СоставНаша.ЭлементКонвертации";
		Запрос.УстановитьПараметр("МассивКонвертаций", МассивКонвертаций);
		ВыборкаЭлементКонвертации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЭлементКонвертации.Следующий() Цикл
			// Создаем копию элемента до изменения.
			ЭлементКонвертацииОбъект = ВыборкаЭлементКонвертации.ЭлементКонвертации.Скопировать();
			ЭлементКонвертацииОбъект.Записать();
			Выборка = ВыборкаЭлементКонвертации.Выбрать();
			Пока Выборка.Следующий() Цикл
				// Меняем состав конвертации.
				СоставКонвертацийОбъект = Выборка.СоставСсылка.ПолучитьОбъект();
				СоставКонвертацийОбъект.ЭлементКонвертации = ЭлементКонвертацииОбъект.Ссылка;
				СоставКонвертацийОбъект.Записать();
			КонецЦикла;
		КонецЦикла;
	КонецЕсли
КонецПроцедуры


#КонецОбласти
